# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 2  # classes: [normal, abnormal]
ch: 3  # number of input channels (RGB images)
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, CBAM, []]                   # 3

  - [-1, 1, Conv, [256, 3, 2]]             # 4-P3/8
  - [-1, 6, C2f, [256, True]]              # 5
  - [-1, 1, CBAM, []]                   # 6

  - [-1, 1, Conv, [512, 3, 2]]             # 7-P4/16
  - [-1, 6, C2f, [512, True]]              # 8
  - [-1, 1, CBAM, []]                   # 9

  - [-1, 1, Conv, [1024, 3, 2]]            # 10-P5/32
  - [-1, 3, C2f, [1024, True]]             # 11
  - [-1, 1, CBAM, []]                  # 12
  - [-1, 1, SPPF, [1024, 5]]               # 13
  - [-1, 1, CBAM, []]                  # 14

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 15
  - [[-1, 8], 1, Concat, [1]]                     # 16 (P4)
  - [-1, 3, C2f, [512]]                           # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 18
  - [[-1, 5], 1, Concat, [1]]                     # 19 (P3)
  - [-1, 3, C2f, [256]]                           # 20 (P3/8)

  - [20, 1, Conv, [256, 3, 2]]                    # 21
  - [[-1, 17], 1, Concat, [1]]                    # 22 (P4)
  - [-1, 3, C2f, [512]]                           # 23 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                    # 24
  - [[-1, 14], 1, Concat, [1]]                    # 25 (P5 backbone)
  - [-1, 3, C2f, [1024]]                          # 26 (P5/32)

  # GUNAKAN SALAH SATU SESUAI VERSI:
  # - [[20, 23, 26], 1, YOLOEDetect, [nc, 512, True]]  # 27 untuk branch yang PUNYA YOLOEDetect
  - [[20, 23, 26], 1, Detect, [nc]]                # 27 untuk branch yang TIDAK PUNYA YOLOEDetect
