# Ultralytics 🚀 YOLOv10s + CBAM Integration
# Modified version: CBAM inserted after each major C2f block in the backbone
# Task: Object detection

# Parameters
nc: 2  # number of classes
scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,   [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv,   [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f,    [128, True]]         # 2
  - [-1, 1, CBAM,   []]                  # 3 CBAM after C2f-128

  - [-1, 1, Conv,   [256, 3, 2]]         # 4-P3/8
  - [-1, 6, C2f,    [256, True]]         # 5
  - [-1, 1, CBAM,   []]                  # 6 CBAM after C2f-256

  - [-1, 1, SCDown, [512, 3, 2]]         # 7-P4/16
  - [-1, 6, C2f,    [512, True]]         # 8
  - [-1, 1, CBAM,   []]                  # 9 CBAM after C2f-512

  - [-1, 1, SCDown, [1024, 3, 2]]        # 10-P5/32
  - [-1, 3, C2f,    [1024, True]]        # 11
  - [-1, 1, CBAM,   []]                  # 12 CBAM after C2f-1024

  - [-1, 1, SPPF,   [1024, 5]]           # 13
  - [-1, 1, CBAM,   []]                  # 14 CBAM after SPPF

  - [-1, 1, PSA,    [1024]]              # 15

# YOLOv10s head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 8], 1, Concat, [1]]                    # 17 cat backbone P4 (orig 6 → new 8)
  - [-1, 3, C2f, [512]]                          # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 5], 1, Concat, [1]]                    # 20 cat backbone P3 (orig 4 → new 5)
  - [-1, 3, C2f, [256]]                          # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 22
  - [[-1, 18], 1, Concat, [1]]                   # 23 cat head P4 (orig 13 → new 18)
  - [-1, 3, C2f, [512]]                          # 24 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]                 # 25
  - [[-1, 15], 1, Concat, [1]]                   # 26 cat head P5 (orig 10 → new 15)
  - [-1, 3, C2fCIB, [1024, True, True]]          # 27 (P5/32-large)

  - [[21, 24, 27], 1, v10Detect, [nc]]           # 28 Detect(P3, P4, P5)
