# Ultralytics 🚀 YOLOv5s + CBAM Integration
# Pattern: CBAM setelah setiap C3 backbone & setelah SPPF
# Task: Object detection (anchor-based Detect, seperti YOLOv5 ori)

# ----------------
# Model params
# ----------------
nc: 2            # number of classes (normal, abnormal)
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]
# ----------------
# Backbone
# ----------------
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C3,   [128]]             # 2
  - [-1, 1, CBAM, []]                # 3  CBAM after C3-128

  - [-1, 1, Conv, [256, 3, 2]]       # 4-P3/8
  - [-1, 9, C3,   [256]]             # 5
  - [-1, 1, CBAM, []]                # 6  CBAM after C3-256

  - [-1, 1, Conv, [512, 3, 2]]       # 7-P4/16
  - [-1, 9, C3,   [512]]             # 8
  - [-1, 1, CBAM, []]                # 9  CBAM after C3-512

  - [-1, 1, Conv, [1024, 3, 2]]      # 10-P5/32
  - [-1, 1, SPPF, [1024, 5]]         # 11
  - [-1, 1, CBAM, []]                # 12 CBAM after SPPF

# ----------------
# Head (YOLOv5 std)
# ----------------
head:
  - [-1, 1, Conv,[512, 1, 1]]               # 13
  - [-1, 1, nn.Upsample,[None, 2, "nearest"]]      # 14
  - [[-1, 8], 1, Concat,[1]]                       # 15  cat backbone P4 (tap C3 index=8)
  - [-1, 3, C3,[512, False]]              # 16

  - [-1, 1, Conv,[256, 1, 1]]               # 17
  - [-1, 1, nn.Upsample,[None, 2, "nearest"]]      # 18
  - [[-1, 5], 1, Concat,[1]]                       # 19  cat backbone P3 (tap C3 index=5)
  - [-1, 3, C3,[256, False]]              # 20  (P3/8)

  - [-1, 1, Conv,[256, 3, 2]]               # 21
  - [[-1, 17], 1, Concat,[1]]                      # 22  cat head P4 (tap 17)
  - [-1, 3, C3,         [512, False]]              # 23  (P4/16)

  - [-1, 1, Conv,[512, 3, 2]]               # 24
  - [[-1, 13], 1, Concat,[1]]                      # 25  cat head P5 (tap 13)
  - [-1, 3, C3,[1024, False]]             # 26  (P5/32)

  - [[20, 23, 26], 1, Detect, [nc, anchors]]       # 27 Detect(P3, P4, P5)
